emb4fun/tinytap/firmware/common/library/tal_frdmn947/cpu/nxp/mcxnx4x/sdk/drivers/fsl_enet.c
    uint32_t address = base->MAC_ADDRESS0_LOW;

    /* Get from physical address lower register. */
    macAddr[3] = (uint8_t)(0xFFU & (address >> 24U));
    macAddr[2] = (uint8_t)(0xFFU & (address >> 16U));
    macAddr[1] = (uint8_t)(0xFFU & (address >> 8U));
    macAddr[0] = (uint8_t)(0xFFU & address);

    /* Get from physical address high register. */
    address    = base->MAC_ADDRESS0_HIGH;
    macAddr[5] = (uint8_t)(0xFFU & (address >> 8U));
    macAddr[4] = (uint8_t)(0xFFU & address);
}

/*!
 * brief Sets the ENET SMI(serial management interface)- MII management interface.
 *
 * param base  ENET peripheral base address.
 */
void ENET_SetSMI(ENET_Type *base, uint32_t clkSrcHz)
{
    uint32_t crDiv  = 0;
    uint32_t clkMhz = clkSrcHz / 1000000U;

    assert((clkMhz >= 20U) && (clkMhz < 250U));

    if (clkMhz < 35U)
    {
        crDiv = 2;
    }
    else if (clkMhz < 60U)
    {
        crDiv = 3;
    }
    else if (clkMhz < 100U)
    {
        crDiv = 0;
    }
    else if (clkMhz < 150U)
    {
        crDiv = 1;
    }
    else if (clkMhz < 250U)
    {
        crDiv = 4;
    }
    else
    {
        /* Intentional empty */
    }

    base->MAC_MDIO_ADDRESS = ENET_MAC_MDIO_ADDRESS_CR(crDiv);
}

/*!
 * brief Starts a SMI write command.
 * support both MDIO IEEE802.3 Clause 22 and clause 45.
 *
 * param base  ENET peripheral base address.
 * param phyAddr The PHY address.
 * param regAddr The PHY register.
 * param data The data written to PHY.
 */
void ENET_StartSMIWrite(ENET_Type *base, uint8_t phyAddr, uint8_t regAddr, uint16_t data)
{
    uint32_t reg = base->MAC_MDIO_ADDRESS & ENET_MAC_MDIO_ADDRESS_CR_MASK;

    /* Build MII write command. */
    base->MAC_MDIO_ADDRESS =
        reg | ENET_MAC_MDIO_ADDRESS_GOC_0(1) | ENET_MAC_MDIO_ADDRESS_PA(phyAddr) | ENET_MAC_MDIO_ADDRESS_RDA(regAddr);
    base->MAC_MDIO_DATA = data;
    base->MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_GB_MASK;
}

/*!
 * brief Starts an SMI read command.
 * support both MDIO IEEE802.3 Clause 22 and clause 45.
 *
 * param base  ENET peripheral base address.
 * param phyAddr The PHY address.
 * param regAddr The PHY register.
 */
void ENET_StartSMIRead(ENET_Type *base, uint8_t phyAddr, uint8_t regAddr)
{
    uint32_t reg = base->MAC_MDIO_ADDRESS & ENET_MAC_MDIO_ADDRESS_CR_MASK;

    /* Build MII read command. */
    base->MAC_MDIO_ADDRESS = reg | ENET_MAC_MDIO_ADDRESS_GOC_0(1) | ENET_MAC_MDIO_ADDRESS_GOC_1(1) |
                             ENET_MAC_MDIO_ADDRESS_PA(phyAddr) | ENET_MAC_MDIO_ADDRESS_RDA(regAddr);
    base->MAC_MDIO_ADDRESS |= ENET_MAC_MDIO_ADDRESS_GB_MASK;
}

static status_t ENET_QOS_MDIOWaitTransferOver(ENET_Type *base)
{
    status_t result = kStatus_Success;
#ifdef ENET_MDIO_TIMEOUT_COUNT
    uint32_t counter;
#endif

#ifdef ENET_QOS_MDIO_TIMEOUT_COUNT
    for (counter = ENET_MDIO_TIMEOUT_COUNT; counter > 0U; counter--)
    {
        if (!ENET_IsSMIBusy(base))
        {
            break;
        }
    }
    /* Check for timeout. */
    if (0U == counter)
    {
        result = kStatus_Timeout;
    }
#else
    while (ENET_IsSMIBusy(base))
    {
    }
#endif
    return result;
}

/*!
 * @brief MDIO write.
 *
 * @param base  ENET peripheral base address.
 * @param phyAddr The PHY address.
 * @param regAddr The PHY register.
 * @param data The data written to PHY.
 * @return kStatus_Success  MDIO access succeeds.
 * @return kStatus_Timeout  MDIO access timeout.
 */
status_t ENET_MDIOWrite(ENET_Type *base, uint8_t phyAddr, uint8_t regAddr, uint16_t data)
{
    ENET_StartSMIWrite(base, phyAddr, regAddr, data);

    return ENET_QOS_MDIOWaitTransferOver(base);
}

/*!
 * @brief MDIO read.
 *
 * @param base  ENET peripheral base address.
 * @param phyAddr The PHY address.
 * @param regAddr The PHY register.
 * @param pData  The data read from PHY.
 * @return kStatus_Success  MDIO access succeeds.
 * @return kStatus_Timeout  MDIO access timeout.
 */
status_t ENET_MDIORead(ENET_Type *base, uint8_t phyAddr, uint8_t regAddr, uint16_t *pData)
{
    assert(pData);

    status_t result;

    ENET_StartSMIRead(base, phyAddr, regAddr);

    result = ENET_QOS_MDIOWaitTransferOver(base);
    if (result != kStatus_Success)
    {
        return result;
    }
    *pData = ENET_ReadSMIData(base);

    return result;
}

/*!
 * brief Set the MAC to enter into power down mode.
 * the remote power wake up frame and magic frame can wake up
 * the ENET from the power down mode.
 *
 * param base    ENET peripheral base address.
 * param wakeFilter  The wakeFilter provided to configure the wake up frame fitlter.
 *  Set the wakeFilter to NULL is not required. But if you have the filter requirement,
 *  please make sure the wakeFilter pointer shall be eight continous
 *  32-bits configuration.
 */
void ENET_EnterPowerDown(ENET_Type *base, uint32_t *wakeFilter)
{
    uint8_t index;
    uint32_t *reg = wakeFilter;

    /* Disable the Tx dma. */
    base->DMA_CH[0].DMA_CHX_TX_CTRL &= ~ENET_DMA_CH_DMA_CHX_TX_CTRL_ST_MASK;
    base->DMA_CH[1].DMA_CHX_TX_CTRL &= ~ENET_DMA_CH_DMA_CHX_TX_CTRL_ST_MASK;

    /* Disable the mac Tx/Rx. */
    base->MAC_CONFIGURATION &= ~(ENET_MAC_CONFIGURATION_RE_MASK | ENET_MAC_CONFIGURATION_TE_MASK);
    /* Enable the remote wakeup packet and enable the power down mode. */
    if (wakeFilter != NULL)
    {
        for (index = 0; index < ENET_WAKEUPFILTER_NUM; index++)
        {
            base->MAC_RWK_PACKET_FILTER = *reg;
            reg++;
        }
    }
    base->MAC_PMT_CONTROL_STATUS = ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MASK |
                                   ENET_MAC_PMT_CONTROL_STATUS_RWKPKTEN_MASK | ENET_MAC_PMT_CONTROL_STATUS_PWRDWN_MASK;

    /* Enable the MAC Rx. */
    base->MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_RE_MASK;
}

/*!
 * brief Set VLAN control.
 *
 * param base  ENET peripheral base address.
 * param control  VLAN control configuration.
 */
status_t ENET_SetVlanCtrl(ENET_Type *base, enet_vlan_ctrl_t *control)
{
    uint32_t vl = (((uint32_t)control->rxVlanTag.pcp) << 13U) | (((uint32_t)control->rxVlanTag.dei) << 12U) |
                  (uint32_t)control->rxVlanTag.vid;
    uint32_t vlanCtrl;

    if ((control->innerVlanFilterMatch) && (!control->doubleVlanEnable))
    {
        return kStatus_Fail;
    }

