emb4fun/tinytap/firmware/common/library/tal_frdmn947/cpu/nxp/mcxnx4x/sdk/drivers/fsl_enet.c
    if ((flag == kENET_FirstFlagOnly) || (flag == kENET_FirstLastFlag))
    {
        if (tsEnable)
        {
            control |= ENET_TXDESCRIP_RD_TTSE_MASK;
        }
        else
        {
            control &= ~ENET_TXDESCRIP_RD_TTSE_MASK;
        }
    }

    if (intEnable)
    {
        control |= ENET_TXDESCRIP_RD_IOC_MASK;
    }
    else
    {
        control &= ~ENET_TXDESCRIP_RD_IOC_MASK;
    }

    /* Preare the descriptor for transmit. */
    txDesc->tdes0 = (uint32_t)(uint32_t *)buffer1;
    txDesc->tdes1 = (uint32_t)(uint32_t *)buffer2;
    txDesc->tdes2 = control;

    control = ENET_TXDESCRIP_RD_SLOT(slotNum) | ENET_TXDESCRIP_RD_FL(framelen) | ENET_TXDESCRIP_RD_LDFD(flag) |
              ENET_TXDESCRIP_RD_OWN_MASK;

    txDesc->tdes3 = control;
}

/*!
 * brief Configure a given Tx descriptor.
 *  This function is a low level functional API to setup or prepare
 *  a given Tx descriptor.
 *
 * param txDesc  The given Tx descriptor.
 * param config The Tx descriptor configuration.
 *
 * note This must be called after all the ENET initilization.
 * And should be called when the ENET receive/transmit is required.
 * Transmit buffers are 'zero-copy' buffers, so the buffer must remain in
 * memory until the packet has been fully transmitted. The buffers
 * should be free or requeued in the transmit interrupt irq handler.
 */
static void ENET_ConfigTxDescriptor(enet_tx_bd_struct_t *txDesc, enet_tx_bd_config_struct_t *config)
{
    uint32_t control                = ENET_TXDESCRIP_RD_BL1(config->bytes1) | ENET_TXDESCRIP_RD_BL2(config->bytes2);
    enet_tx_offload_t txOffloadMode = kENET_TxOffloadDisable;

    if ((config->flag == kENET_FirstFlagOnly) || (config->flag == kENET_FirstLastFlag))
    {
        if (config->tsEnable)
        {
            control |= ENET_TXDESCRIP_RD_TTSE_MASK;
        }
        else
        {
            control &= ~ENET_TXDESCRIP_RD_TTSE_MASK;
        }
        txOffloadMode = config->txOffloadOps;
    }

    if (config->intEnable)
    {
        control |= ENET_TXDESCRIP_RD_IOC_MASK;
    }
    else
    {
        control &= ~ENET_TXDESCRIP_RD_IOC_MASK;
    }

    /* Preare the descriptor for transmit. */
    txDesc->tdes0 = (uint32_t)(uint32_t *)config->buffer1;
    txDesc->tdes1 = (uint32_t)(uint32_t *)config->buffer2;
    txDesc->tdes2 = control;

    control = ENET_TXDESCRIP_RD_SLOT(config->slotNum) | ENET_TXDESCRIP_RD_FL(config->framelen) |
              ENET_TXDESCRIP_RD_CIC(txOffloadMode) | ENET_TXDESCRIP_RD_LDFD(config->flag) | ENET_TXDESCRIP_RD_OWN_MASK;

    txDesc->tdes3 = control;
}

/*!
 * brief Reclaim Tx descriptors.
 *  This function is used to update the Tx descriptor status and
 *  store the Tx timestamp when the 1588 feature is enabled.
 *  This is called by the transmit interupt IRQ handler after the
 *  complete of a frame transmission.
 *
 * param base    ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param channel  The Tx DMA channnel.
 *
 */
void ENET_ReclaimTxDescriptor(ENET_Type *base, enet_handle_t *handle, uint8_t channel)
{
    enet_tx_bd_ring_t *txBdRing       = &handle->txBdRing[channel];
    enet_tx_bd_struct_t *txDesc       = txBdRing->txBdBase + txBdRing->txConsumIdx;
    enet_tx_dirty_ring_t *txDirtyRing = (enet_tx_dirty_ring_t *)&handle->txDirtyRing[channel];
    enet_tx_reclaim_info_t *txDirty   = NULL;

    /* Need to update the first index for transmit buffer free. */
    while ((txBdRing->txDescUsed > 0U) && ((txDesc->tdes3 & ENET_TXDESCRIP_RD_OWN_MASK) == 0U))
    {
        if ((txDesc->tdes3 & ENET_TXDESCRIP_RD_LD_MASK) != 0U)
        {
            txDirty                  = &txDirtyRing->txDirtyBase[txDirtyRing->txConsumIdx];
            txDirtyRing->txConsumIdx = ENET_IncreaseIndex(txDirtyRing->txConsumIdx, txDirtyRing->txRingLen);
            txDirty->isTsAvail       = false;

#ifdef ENET_PTP1588FEATURE_REQUIRED
            uint32_t nanosecond = 0;

            if ((txDesc->tdes3 & ENET_TXDESCRIP_WB_TTSS_MASK) != 0U)
            {
                /* Get transmit time stamp second. */
                nanosecond = txDesc->tdes0;
                if ((base->MAC_TIMESTAMP_CONTROL & ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MASK) == 0U)
                {
                    /* Binary rollover. */
                    txDirty->timeStamp.nanosecond = ENET_BINARY_ROLLOVER_SCALE(nanosecond);
                }
                else
                {
                    txDirty->timeStamp.nanosecond = nanosecond;
                }
                txDirty->timeStamp.second = txDesc->tdes1;
                txDirty->isTsAvail        = true;
            }
#endif /* ENET_PTP1588FEATURE_REQUIRED */
            /* For Tx buffer free or requeue for each descriptor.
             * The Tx interrupt callback should free/requeue the Tx buffer. */
            if (handle->callback != NULL)
            {
                handle->callback(base, handle, kENET_TxIntEvent, channel, txDirty, handle->userData);
            }
        }

        /* Update the used Tx descriptor count. */
        txBdRing->txDescUsed--;

        /* Update the txConsumIdx/txDesc. */
        txBdRing->txConsumIdx = ENET_IncreaseIndex(txBdRing->txConsumIdx, txBdRing->txRingLen);
        txDesc                = txBdRing->txBdBase + txBdRing->txConsumIdx;
    }
}

/*!
 * brief Transmits an ENET frame.
 * note The CRC is automatically appended to the data. Input the data
 * to send without the CRC. This API uses input buffer for Tx, application
 * should reclaim the buffer after Tx is over.
 *
 * param base  ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param txFrame The Tx frame structure.
 * param channel Channel to send the frame, same with queue index.
 * retval kStatus_Success  Send frame succeed.
 * retval kStatus_ENET_TxFrameBusy  Transmit buffer descriptor is busy under transmission.
 *        The transmit busy happens when the data send rate is over the MAC capacity.
 *        The waiting mechanism is recommended to be added after each call return with kStatus_ENET_TxFrameBusy.
 *        Also need to pay attention to reclaim Tx frame after Tx is over.
 * retval kStatus_ENET_TxFrameOverLen  Transmit frme length exceeds the 0x3FFF limit defined by the driver.
 */
status_t ENET_SendFrame(ENET_Type *base, enet_handle_t *handle, enet_tx_frame_struct_t *txFrame, uint8_t channel)
{
    assert(handle);
    assert(handle->txDirtyRing[channel].txDirtyBase != NULL);
    assert(txFrame);
    assert(txFrame->txBuffNum != 0U);
    assert(txFrame->txBuffArray != NULL);

    enet_tx_bd_ring_t *txBdRing       = (enet_tx_bd_ring_t *)&handle->txBdRing[channel];
    enet_tx_dirty_ring_t *txDirtyRing = (enet_tx_dirty_ring_t *)&handle->txDirtyRing[channel];
    enet_tx_reclaim_info_t *txDirty   = &txDirtyRing->txDirtyBase[txDirtyRing->txGenIdx];
    enet_buffer_struct_t *txBuff      = txFrame->txBuffArray;
    uint32_t frameLen                 = 0;
    uint32_t index                    = 0;
    enet_tx_bd_struct_t *txDesc;
    enet_desc_flag_t descFlag;
    uint32_t leftBuffNum;

    /* Calculate total frame length and the Tx buffer number if it's scattered. */
    for (index = 0; index < txFrame->txBuffNum; index++)
    {
        frameLen += txBuff[index].length;
    }

    /* Here use maximum length of single buffer in hardware as transmit length limitation, cause it's long enough.
     * And it simplifies the check of buffer length. There's no need to check each buffer length. */
    if (frameLen > ENET_FRAME_TX_LEN_LIMITATION)
    {
        return kStatus_ENET_TxFrameOverLen;
    }

