emb4fun/tinytap/firmware/common/library/tal_frdmn947/cpu/nxp/mcxnx4x/sdk/drivers/fsl_enet.c
    /* Check Tx FIFO whether can store enough frame data. */
    if (0U != handle->txLenLimitation[channel])
    {
        if (frameLen > handle->txLenLimitation[channel])
        {
            return kStatus_ENET_TxFrameOverLen;
        }
    }

    /* Check whether the available BD number is enough for Tx data buffer. */
    if (txFrame->txBuffNum > (((uint32_t)txBdRing->txRingLen - (uint32_t)txBdRing->txDescUsed) * 2U))
    {
        return kStatus_ENET_TxFrameBusy;
    }

    /* Update the context in Tx dirty ring for reclaim */
    txDirty->context      = txFrame->context;
    txDirtyRing->txGenIdx = ENET_IncreaseIndex(txDirtyRing->txGenIdx, txDirtyRing->txRingLen);

    index       = 0;
    leftBuffNum = txFrame->txBuffNum;
    do
    {
        txDesc = &txBdRing->txBdBase[txBdRing->txGenIdx];

        /* Get the right flag for current BD */
        if (leftBuffNum == txFrame->txBuffNum)
        {
            descFlag = (leftBuffNum > 2U) ? kENET_FirstFlagOnly : kENET_FirstLastFlag;
        }
        else
        {
            descFlag = (leftBuffNum > 2U) ? kENET_MiddleFlag : kENET_LastFlagOnly;
        }

        enet_tx_bd_config_struct_t txDescConfig = {0};

        txDescConfig.framelen     = frameLen;
        txDescConfig.intEnable    = (bool)txFrame->txConfig.intEnable;
        txDescConfig.tsEnable     = (bool)txFrame->txConfig.tsEnable;
        txDescConfig.txOffloadOps = txFrame->txConfig.txOffloadOps;
        txDescConfig.flag         = descFlag;
        txDescConfig.slotNum      = txFrame->txConfig.slotNum;

        /* Fill the descriptor. */
        txDescConfig.buffer1 = txBuff[index].buffer;
        txDescConfig.bytes1  = txBuff[index].length;
        if (leftBuffNum < 2U)
        {
            txDescConfig.buffer2 = NULL;
            txDescConfig.bytes2  = 0;
            leftBuffNum--;
        }
        else
        {
            txDescConfig.buffer2 = txBuff[index + 1U].buffer;
            txDescConfig.bytes2  = txBuff[index + 1U].length;
            index += 2U;
            leftBuffNum -= 2U;
        }
        ENET_ConfigTxDescriptor(txDesc, &txDescConfig);

        /* Increase the index. */
        txBdRing->txGenIdx = ENET_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);

        /* Disable interrupt first and then enable interrupt to avoid the race condition. */
        (void)DisableIRQ(s_enetIrqId[ENET_GetInstance(base)]);
        txBdRing->txDescUsed++;
        (void)EnableIRQ(s_enetIrqId[ENET_GetInstance(base)]);
    } while (leftBuffNum != 0U);

    /* Update the transmit tail address. */
    txDesc = (txBdRing->txGenIdx == 0U) ? (&txBdRing->txBdBase[txBdRing->txRingLen]) :
                                          (&txBdRing->txBdBase[txBdRing->txGenIdx]);
    base->DMA_CH[channel].DMA_CHX_TXDESC_TAIL_PTR = (uint32_t)txDesc & ~ENET_ADDR_ALIGNMENT;

    return kStatus_Success;
}

#ifdef ENET_PTP1588FEATURE_REQUIRED
/*!
 * brief Gets the current ENET time from the PTP 1588 timer.
 *       Interrupts are not disabled.
 *
 * param base  ENET peripheral base address.
 * param second The PTP 1588 system timer second.
 * param nanosecond The PTP 1588 system timer nanosecond.
 */
void ENET_Ptp1588GetTimerNoIrqDisable(ENET_Type *base, uint64_t *second, uint32_t *nanosecond)
{
    assert(second);
    assert(nanosecond);

    /* Get the current PTP time. */
    *second     = base->MAC_SYSTEM_TIME_SECONDS;
    *nanosecond = base->MAC_SYSTEM_TIME_NANOSECONDS & ENET_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MASK;
    if (!((base->MAC_TIMESTAMP_CONTROL & ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MASK) != 0U))
    {
        /* Binary rollover, the unit of the increment is ~ 0.466 ns. */
        *nanosecond = ENET_BINARY_ROLLOVER_SCALE(*nanosecond);
    }
}

/*!
 * brief Gets the current ENET time from the PTP 1588 timer.
 *
 * param base  ENET peripheral base address.
 * param second The PTP 1588 system timer second.
 * param nanosecond The PTP 1588 system timer nanosecond.
 * For the unit of the nanosecond is 1ns. So the nanosecond is the real nanosecond.
 */
void ENET_Ptp1588GetTimer(ENET_Type *base, uint64_t *second, uint32_t *nanosecond)
{
    assert(second);
    assert(nanosecond);

    uint32_t primask;

    /* Disables the interrupt. */
    primask = DisableGlobalIRQ();

    ENET_Ptp1588GetTimerNoIrqDisable(base, second, nanosecond);

    /* Enables the interrupt. */
    EnableGlobalIRQ(primask);
}

/*!
 * brief Correct the ENET PTP 1588 timer in coarse method.
 *
 * param base  ENET peripheral base address.
 * param operation The system time operation, refer to "enet_systime_op_t"
 * param second The correction second.
 * param nanosecond The correction nanosecond.
 */
void ENET_Ptp1588CorrectTimerInCoarse(ENET_Type *base,
                                      enet_systime_op_t operation,
                                      uint32_t second,
                                      uint32_t nanosecond)
{
    uint32_t corrSecond = second;
    uint32_t corrNanosecond;

    /* Set the system timer. */
    if ((base->MAC_TIMESTAMP_CONTROL & ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MASK) != 0U)
    {
        if (operation == kENET_SystimeSubtract)
        {
            /* Set with the complement of the sub-second. */
            corrSecond     = ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK - (second - 1U);
            corrNanosecond = ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK |
                             ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(ENET_NANOSECS_ONESECOND - nanosecond);
        }
        else
        {
            corrNanosecond = ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(nanosecond);
        }
    }
    else
    {
        nanosecond = ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK / ENET_NANOSECS_ONESECOND * nanosecond;
        if (operation == kENET_SystimeSubtract)
        {
            /* Set with the complement of the sub-second. */
            corrSecond     = ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK - (second - 1U);
            corrNanosecond = ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MASK |
                             ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(
                                 ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK + 1U - nanosecond);
        }
        else
        {
            corrNanosecond = ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(nanosecond);
        }
    }

    base->MAC_SYSTEM_TIME_SECONDS_UPDATE     = corrSecond;
    base->MAC_SYSTEM_TIME_NANOSECONDS_UPDATE = corrNanosecond;

